## Plan Result (prod-idp)




<pre><code>Plan: 7 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.vnet.azurerm_resource_group.rg
  * module.vnet.azurerm_subnet.postgresql_subnet[&#34;10.131.10.0/27&#34;]
  * module.vnet.azurerm_subnet.sb[0]
  * module.vnet.azurerm_subnet.sb[1]
  * module.vnet.azurerm_subnet.sb[2]
  * module.vnet.azurerm_subnet.sb[3]
  * module.vnet.azurerm_virtual_network.vnet




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.vnet.azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "idp-poc-infra-prod"
      + tags     = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/idp-shared-infrastructure"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
    }

  # module.vnet.azurerm_subnet.postgresql_subnet["10.131.10.0/27"] will be created
  + resource "azurerm_subnet" "postgresql_subnet" {
      + address_prefixes                               = [
          + "10.131.10.0/27",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "postgresql"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "idp-poc-infra-prod"
      + virtual_network_name                           = "idp-poc-infra-vnet-prod"

      + delegation {
          + name = "fs"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/join/action",
                ]
              + name    = "Microsoft.DBforPostgreSQL/flexibleServers"
            }
        }
    }

  # module.vnet.azurerm_subnet.sb[0] will be created
  + resource "azurerm_subnet" "sb" {
      + address_prefixes                               = [
          + "10.131.1.0/28",
        ]
      + enforce_private_link_endpoint_network_policies = true
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "idp-poc-infra-subnet-0-prod"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "idp-poc-infra-prod"
      + virtual_network_name                           = "idp-poc-infra-vnet-prod"
    }

  # module.vnet.azurerm_subnet.sb[1] will be created
  + resource "azurerm_subnet" "sb" {
      + address_prefixes                               = [
          + "10.131.1.16/28",
        ]
      + enforce_private_link_endpoint_network_policies = true
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "idp-poc-infra-subnet-1-prod"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "idp-poc-infra-prod"
      + virtual_network_name                           = "idp-poc-infra-vnet-prod"
    }

  # module.vnet.azurerm_subnet.sb[2] will be created
  + resource "azurerm_subnet" "sb" {
      + address_prefixes                               = [
          + "10.131.1.32/28",
        ]
      + enforce_private_link_endpoint_network_policies = true
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "idp-poc-infra-subnet-2-prod"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "idp-poc-infra-prod"
      + virtual_network_name                           = "idp-poc-infra-vnet-prod"
    }

  # module.vnet.azurerm_subnet.sb[3] will be created
  + resource "azurerm_subnet" "sb" {
      + address_prefixes                               = [
          + "10.131.1.48/28",
        ]
      + enforce_private_link_endpoint_network_policies = true
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "idp-poc-infra-subnet-3-prod"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "idp-poc-infra-prod"
      + virtual_network_name                           = "idp-poc-infra-vnet-prod"
    }

  # module.vnet.azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space       = [
          + "10.131.1.0/24",
        ]
      + dns_servers         = [
          + "10.131.1.46",
          + "168.63.129.16",
        ]
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "idp-poc-infra-vnet-prod"
      + resource_group_name = "idp-poc-infra-prod"
      + subnet              = (known after apply)
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/idp-shared-infrastructure"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
    }

Plan: 7 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":6,"Program":"tfcmt","SHA1":"","Target":"prod-idp","Vars":{}} -->